; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem satellite-89)
 (:domain satellite)
 (:objects 
    sat1 sat2 sat3 sat4 sat5 sat6 sat7 sat8 sat9 sat10 - satellite
    ins1 ins2 ins3 ins4 ins5 ins6 ins7 ins8 ins9 ins10 ins11 ins12 ins13 ins14 ins15 ins16 ins17 ins18 - instrument
    mod1 mod2 mod3 - mode
    dir1 dir2 dir3 dir4 dir5 dir6 dir7 dir8 dir9 dir10 - direction
    )
 (:init 
    (pointing sat1 dir9)
    (pointing sat2 dir4)
    (pointing sat3 dir10)
    (pointing sat4 dir5)
    (pointing sat5 dir2)
    (pointing sat6 dir6)
    (pointing sat7 dir4)
    (pointing sat8 dir8)
    (pointing sat9 dir10)
    (pointing sat10 dir3)
    (power_avail sat1)
    (power_avail sat2)
    (power_avail sat3)
    (power_avail sat4)
    (power_avail sat5)
    (power_avail sat6)
    (power_avail sat7)
    (power_avail sat8)
    (power_avail sat9)
    (power_avail sat10)
    (calibration_target ins1 dir2)
    (calibration_target ins2 dir5)
    (calibration_target ins3 dir8)
    (calibration_target ins4 dir4)
    (calibration_target ins5 dir9)
    (calibration_target ins6 dir7)
    (calibration_target ins7 dir7)
    (calibration_target ins8 dir3)
    (calibration_target ins9 dir6)
    (calibration_target ins10 dir5)
    (calibration_target ins11 dir8)
    (calibration_target ins12 dir2)
    (calibration_target ins13 dir7)
    (calibration_target ins14 dir2)
    (calibration_target ins15 dir9)
    (calibration_target ins16 dir8)
    (calibration_target ins17 dir10)
    (calibration_target ins18 dir2)
    (on_board ins1 sat6)
    (on_board ins2 sat4)
    (on_board ins3 sat2)
    (on_board ins4 sat7)
    (on_board ins5 sat1)
    (on_board ins6 sat10)
    (on_board ins7 sat3)
    (on_board ins8 sat5)
    (on_board ins9 sat8)
    (on_board ins10 sat9)
    (on_board ins11 sat3)
    (on_board ins12 sat6)
    (on_board ins13 sat7)
    (on_board ins14 sat2)
    (on_board ins15 sat8)
    (on_board ins16 sat2)
    (on_board ins17 sat10)
    (on_board ins18 sat1)
    (supports ins13 mod2)
    (supports ins1 mod2)
    (supports ins2 mod2)
    (supports ins7 mod1)
    (supports ins15 mod3)
    (supports ins11 mod3)
    (supports ins12 mod1)
    (supports ins16 mod1)
    (supports ins10 mod1)
    (supports ins4 mod2)
    (supports ins12 mod2)
    (supports ins6 mod2)
    (supports ins15 mod2)
    (supports ins17 mod3)
    (supports ins14 mod3)
    (supports ins2 mod3)
    (supports ins16 mod3)
    (supports ins13 mod1)
    (supports ins18 mod2)
    (supports ins3 mod2)
    (supports ins6 mod3)
    (supports ins17 mod2)
    (supports ins8 mod2)
    (supports ins3 mod3)
    (supports ins4 mod1)
    (supports ins14 mod2)
    (supports ins1 mod3)
    (supports ins7 mod3)
    (supports ins9 mod2)
    (supports ins4 mod3)
    (supports ins9 mod1)
    (supports ins12 mod3)
    (supports ins10 mod2)
    (supports ins2 mod1)
    (supports ins6 mod1)
    (supports ins13 mod3)
    (supports ins8 mod1)
    (supports ins18 mod1)
    (supports ins3 mod1)
    (supports ins10 mod3)
    (supports ins17 mod1)
    (supports ins16 mod2)
    (supports ins5 mod3))
 (:goal (and 
(have_image dir9 mod2)
))
)

; plan
1. (switch_on ins15 sat8)
   deleted: (power_avail sat8)
   added: (power_on ins15)
   goals met: 0 of 1
2. (turn_to sat8 dir9 dir8)
   deleted: (pointing sat8 dir8)
   added: (pointing sat8 dir9)
   goals met: 0 of 1
3. (calibrate sat8 ins15 dir9)
   added: (calibrated ins15)
   goals met: 0 of 1
4. (take_image sat8 dir9 ins15 mod2)
   added: (have_image dir9 mod2)
   goals met: 1 of 1
